packages/fxa-auth-server/test/local/payments/fixtures/stripe/invoice_preview_tax.json

{
  "object": "invoice",
  "account_country": "US",
  "account_name": "Mozilla Corporation",
  "account_tax_ids": null,
  "amount_due": 2323,
  "amount_paid": 0,
  "amount_remaining": 2323,
  "application_fee_amount": null,
  "attempt_count": 0,
  "attempted": false,
  "automatic_tax": {
    "enabled": false,
    "status": null
  },
  "billing_reason": "upcoming",
  "collection_method": "charge_automatically",
  "created": 1638387404,
  "currency": "usd",
  "custom_fields": null,
  "customer": null,
  "customer_address": {
    "city": null,
    "country": "DE",
    "line1": null,
    "line2": null,
    "postal_code": null,
    "state": null
  },
  "customer_email": null,
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [
    {
      "id": "txr_1JALB2BVqmGyQTMa3ltU6p6y",
      "object": "tax_rate",
      "active": true,
      "country": "DE",
      "created": 1625604452,
      "description": "DE VAT",
      "display_name": "VAT",
      "inclusive": true,
      "jurisdiction": null,
      "livemode": false,
      "metadata": {},
      "percentage": 19,
      "state": null,
      "tax_type": null
    }
  ],
  "description": null,
  "discounts": [],
  "due_date": null,
  "ending_balance": 0,
  "footer": null,
  "last_finalization_error": null,
  "lines": {
    "object": "list",
    "data": [
      {
        "id": "il_tmp_1b032fBVqmGyQTMa6c981a47",
        "object": "line_item",
        "amount": 2323,
        "currency": "usd",
        "description": "1 × Robin K Wilson (at $23.23 / month)",
        "discount_amounts": [],
        "discountable": true,
        "discounts": [],
        "livemode": false,
        "metadata": {},
        "period": {
          "end": 1641065804,
          "start": 1638387404
        },
        "pricing": {
          "price_details": {
            "price": "price_1JkZUtBVqmGyQTMabzHiPgmR",
            "product": "prod_KPOHRv5MheicuD"
          },
          "type": "price_details",
          "unit_amount_decimal": "2323"
        },
        "quantity": 1,
        "parent": {
          "type": "subscription_item_details",
          "subscription_item_details": {
            "subscription": "sub_1K1ybgBVqmGyQTMapiusG1Xd",
            "subscription_item": "si_KhNMIdH4bqqOyQ",
            "proration": false,
            "proration_details": null
          },
          "invoice_item_details": null
        },
        "taxes": [
          {
            "amount": 371,
            "tax_behavior": "inclusive",
            "tax_rate_details": {
              "tax_rate": {
                "display_name": "GST"
              }
            }
          }
        ],
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/invoices/upcoming/lines?"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": 1638391004,
  "number": "72ABE14-0001",
  "on_behalf_of": null,
  "parent": {
    "type": "subscription_details",
    "subscription_details": {
      "subscription": "sub_1K1ybgBVqmGyQTMapiusG1Xd"
    }
  },
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null
  },
  "period_end": 1638387404,
  "period_start": 1638387404,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "quote": null,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "draft",
  "status_transitions": {
    "finalized_at": null,
    "marked_uncollectible_at": null,
    "paid_at": null,
    "voided_at": null
  },
  "subscription_proration_date": 1638387404,
  "subtotal": 2323,
  "total": 2323,
  "total_discount_amounts": [],
  "total_taxes": [
    {
      "amount": 371,
      "tax_behavior": "inclusive",
      "tax_rate_details": {
        "tax_rate": {
          "display_name": "GST"
        }
      }
    }
  ],
  "transfer_data": null,
  "webhooks_delivered_at": null
}
