packages/fxa-auth-server/test/local/payments/fixtures/stripe/invoice_preview_tax_discount.json

{
  "object": "invoice",
  "account_country": "US",
  "account_name": "Mozilla Corporation",
  "account_tax_ids": null,
  "amount_due": 1824,
  "amount_paid": 0,
  "amount_remaining": 1824,
  "application_fee_amount": null,
  "attempt_count": 0,
  "attempted": false,
  "automatic_tax": {
    "enabled": false,
    "status": null
  },
  "billing_reason": "upcoming",
  "collection_method": "charge_automatically",
  "created": 1638235373,
  "currency": "usd",
  "custom_fields": null,
  "customer": null,
  "customer_address": {
    "city": null,
    "country": null,
    "line1": null,
    "line2": null,
    "postal_code": null,
    "state": "DE"
  },
  "customer_email": null,
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [
    {
      "id": "txr_1JALB2BVqmGyQTMa3ltU6p6y",
      "object": "tax_rate",
      "active": true,
      "country": "DE",
      "created": 1625604452,
      "description": "DE VAT",
      "display_name": "VAT",
      "inclusive": true,
      "jurisdiction": null,
      "livemode": false,
      "metadata": {},
      "percentage": 19,
      "state": null,
      "tax_type": null
    }
  ],
  "description": null,
  "discounts": [
    {
      "id": "di_1K1L3ZBVqmGyQTMaIu772FxN",
      "object": "discount",
      "checkout_session": null,
      "customer": "cus_KgiUdgpzGqzCea",
      "end": null,
      "invoice": null,
      "invoice_item": null,
      "promotion_code": null,
      "start": 1638235373,
      "subscription": "sub_1K1L3ZBVqmGyQTMascpG5XMk",
      "source": {
        "coupon": {
          "id": "BPGwCW2H",
          "object": "coupon",
          "amount_off": 499,
          "created": 1591322557,
          "currency": "usd",
          "duration": "once",
          "duration_in_months": null,
          "livemode": false,
          "max_redemptions": 50,
          "metadata": {},
          "name": "Discount $4.99 50 times",
          "percent_off": null,
          "redeem_by": null,
          "times_redeemed": 13,
          "valid": true
        },
        "type": "coupon"
      }
    }
  ],
  "due_date": null,
  "ending_balance": 0,
  "footer": null,
  "last_finalization_error": null,
  "lines": {
    "object": "list",
    "data": [
      {
        "id": "il_tmp_172d3eBVqmGyQTMa2cb1d666",
        "object": "line_item",
        "amount": 2323,
        "currency": "usd",
        "description": "1 \u00d7 Robin K Wilson (at $23.23 / month)",
        "discount_amounts": [
          {
            "amount": 499,
            "discount": "di_1K1L3ZBVqmGyQTMaIu772FxN"
          }
        ],
        "discountable": true,
        "discounts": [],
        "livemode": false,
        "metadata": {},
        "period": {
          "end": 1640827373,
          "start": 1638235373
        },
        "quantity": 1,
        "tax_rates": [],
        "pricing": {
          "price_details": {
            "price": "price_1JkZUtBVqmGyQTMabzHiPgmR",
            "product": "prod_KPOHRv5MheicuD"
          },
          "type": "price_details",
          "unit_amount_decimal": "2323"
        },
        "parent": {
          "type": "subscription_item_details",
          "subscription_item_details": {
            "subscription": "sub_1K1L3ZBVqmGyQTMascpG5XMk",
            "subscription_item": "si_KgiUz0pUJIOrfh",
            "proration": false,
            "proration_details": null
          },
          "invoice_item_details": null
        },
        "taxes": [
          {
            "amount": 291,
            "tax_behavior": "inclusive",
            "tax_rate_details": {
              "tax_rate": "txr_1JALB2BVqmGyQTMa3ltU6p6y"
            }
          }
        ]
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/invoices/upcoming/lines?coupon=BPGwCW2H"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": 1638238973,
  "number": "A17F35F-0001",
  "on_behalf_of": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null
  },
  "period_end": 1638235373,
  "period_start": 1638235373,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "quote": null,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "draft",
  "status_transitions": {
    "finalized_at": null,
    "marked_uncollectible_at": null,
    "paid_at": null,
    "voided_at": null
  },
  "subscription_proration_date": 1638235373,
  "subtotal": 2323,
  "total": 1824,
  "total_discount_amounts": [
    {
      "amount": 499,
      "discount": "di_1K1L3ZBVqmGyQTMaIu772FxN"
    }
  ],
  "transfer_data": null,
  "webhooks_delivered_at": null,
  "parent": {
    "type": "subscription_details",
    "subscription_details": {
      "subscription": "sub_1K1L3ZBVqmGyQTMascpG5XMk"
    }
  },
  "total_taxes": [
    {
      "amount": 291,
      "tax_behavior": "inclusive",
      "tax_rate_details": {
        "tax_rate": "txr_1JALB2BVqmGyQTMa3ltU6p6y"
      }
    }
  ]
}
